Public Attributes | List of all members
API_SavePars_Saf Struct Reference
Project Operations
Contains the export filter type for the SAF file. More...
#include <APIdefs_Automate.h>
 Public Attributes
API_ElementsToSAFExportID  | elementsToSAFExport
Type of export filter for the SAF Export. It affects the elements to be exported: whether the whole project, only visible elements or only selected elements are exported.
GS::UniString  | selectedSAFTranslatorName
Name of SAF Translator used for the SAF Export. It is one of the names listed on the SAF Translators dialog. It affects the profiles and materials of elements, output version, etc.
Detailed Description
Contains the export filter type for the SAF file.
Since
Archicad 26
Remarks
If you want to save the content of a window, the type of the file fileTypeID in API_FileSavePars should be set to APIFType_SafFile. In case of 3D and Master Layout Archicad will export the floor plan.
Member Data Documentation
◆ elementsToSAFExport
 API_SavePars_Saf::elementsToSAFExport
Type of export filter for the SAF Export. It affects the elements to be exported: whether the whole project, only visible elements or only selected elements are exported.
◆ selectedSAFTranslatorName
 API_SavePars_Saf::selectedSAFTranslatorName
Name of SAF Translator used for the SAF Export. It is one of the names listed on the SAF Translators dialog. It affects the profiles and materials of elements, output version, etc.